Revit 2024 API
BuiltInFailures.RoomFailures.AreaUnplaceWarning Property
 An Area was deleted from all model views but still remains in this project. \n The area can be removed from any schedule or placed back in the model using the Area command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AreaUnplaceWarning { get; }
Visual Basic
Public Shared ReadOnly Property AreaUnplaceWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AreaUnplaceWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace